orgs/new-todo-system.org
#+title: 我的全新TODO管理系统
#+date: Tue Feb  3 10:50:12 2026
#+author: Zi Liang
#+email: zi1415926.liang@connect.polyu.hk
#+latex_class: elegantpaper
#+filetags: :TODO:


最近又重新思考了一下如何进行个人工作的版本流控制，对之前的reflection思路进行了一波改造升级。

改进的原则是：

+ 实用大于美观。不过度追求所覆盖的全面和完整，只聚焦在最重要的几个方向。其余的则放空
+ 强调可持续性。
  + 提供退出机制，以应对较为简单的个人记录。
  + 提供模板，以方便插入
  + 在文件管理与版本控制上也突出可持续。不会出现过往todo list过于复杂的情况
+ 与当前工作流深度嵌入
  + Git集成与全端浏览
  + Emacs + Org Mode集成
+ 诚实与robustness
  + 仓库私有
  + 扩展性强

目前新版的个人版本控制流程如下。

* 系统组件分析

整体的项目如下图所示：

#+begin_src shell
├── appearance
│   ├── cloth.org
│   └── haircut.org
├── body
│   ├── physical
│   │   └── 2026-M02.org
│   └── sexual-love
│       └── 2026-02.org
├── finance
│   ├── monthly
│   │   └── 2026-M02.org
│   └── yearly
│       └── 2026.org
├── inbox.org
├── README.md
├── reflection
│   ├── monthly
│   │   └── 2026-M02.org
│   ├── quarterly
│   │   └── 2026-Q1.org
│   ├── weekly
│   │   └── 2026-W06.org
│   └── yearly
│       └── 2026.org
├── weekly
│   └── 2026-W06.org
#+end_src

可以看出，整个项目仅仅包含四个方面，分别是周报（weekly），经济、身体、外貌。至于其他，比如社交等等暂时没有加进去；阅读之类的也没有显式地加进去。这不是因为后面二者并不重要，而是他们并不需要非常严格的长期监控与处理。

对于所关注的四个方面，只有weekly是需要日常维护的，剩余的如appearance、body、finance都可以以一个较低的频率进行更新。reflection则需要每周更新。具体来说是：

+ Weekly：将一周七天的所有计划纳入一个文件中进行管理。
+ Appearance：负责管理我的外在，维持作为一个正常人类的形象
  + Cloth：对我的衣服进行管理。定期更新、删除、修改。
  + Haircut：对我的头发进行管理。定期修理。
+ Body：负责监控我的身体状况。与Appearance一样，我认为这也是仍然需要重点关注的点。
  + Physical：指个人的身体素质。包括：体重、体脂等个人数据。从每周的周报中统计进行各项体育运动、健身等等的强度，以构成反馈。
  + Sexual-Love：用于监控个人的性压抑程度。记录自己的性行为次数、频率、相关人员、时间。由此进行后续的心理健康状况分析。
+ Finance：记录自己的经济状况。
  + Monthly：每个月都记录自己的支出和收益，挖掘出不合理的支出。设定消费数目，对金钱进行合理的分配。
  + Yearly：从全年的角度制定每一年的经济计划 （如学生时期可能以尽量产生赤字为主，多体验）。并设置每个方向的消费比重。
+ Reflection
  + Weekly：基于每周周日志的文件对本周状态进行总结。 聚焦在细节。
  + Monthly：对于每个月的情况进行总结。 每个月都应该让事态产生明显变化。
  + Quarterly：对于每个季度进行总结。 每个季度都应该完成一个战略目标点。
  + Yearly：对全年的总结。 这应该站在一个比较高的层面进行总结。
+ Inbox：用于记录某些灵光。需要被定期清理。


* 一个理想的运行结构

1. 每日开始，应该打开当周的weekly，撰写上一日的reflection
2. 应排列今日的TODO，并按照流程逐步进行。
3. 每周周五晚上或周六上午，应该进行每周的reflection，并整理手机上的身体数据。
4. 每个月发工资时，对于这个月的银行流水进行总结和记录。检查银行卡、微信、支付宝等。
5. 每个月月末阅读该月的relfection，然后撰写月度总结。
6. 每次和导师开完会对appearance的情况进行一次更新。
7. 每个季度撰写反思和总结。
8. 每年都对全年的情况进行一次系统的分析。可以把语料发给AI。


维持持续记录的要点：
1. 在周一、二 等日安排攻坚的难题。
2. research等tag的TODO ITEM个数应该与body、fiction、relax等实现平衡。
3. 允许在某些特殊天里“潦草记录”。但是认为连续性最为重要。
4. 允许补录。允许潦草补录。




* Weekly 模板

我使用emacs的yas snippets搞了一个每周模板。如下：

#+begin_src snippets

# -*- mode: snippet -*-
# name: daily-reflection-org
# key: todo-week
# group: org-mode
# --
# -*- mode: snippet -*-
# name: weekly-daily-reflection-org
# key: wdr
# group: org-mode
# --
* <`(format-time-string "%Y-%m-%d %a")`> 今日核心主题 :工作日:
** 今日计划 [%]
*** TODO 完成ablation实验 【上午完成，优先推进】 :research:#A:
*** TODO 理解现有agent memory机制 【通勤途中梳理】 :research:
*** CANCELED 暂缓任务示例 【标注原因，可选】
*** TODO 腹部 健身 :body:
*** TODO 有氧 30min :body:
*** TODO 23:00前早睡 :body:routine:
*** TODO 阅读小说《全力的游戏》 :English:fiction:
*** TODO 阅读《庄子》 :Phi:

** 今日反思（核心模块，对应保持/失误/改进）
*** 1. 总体评价（一句话总结今日状态）
- 示例：总体完成核心工作任务，状态专注，时间分配基本合理；或今日进度滞后，需调整优先级和时间管理。

*** 2. 值得保持的点（提炼优势/好习惯，具体到场景）
1. 
2. 
3. 

*** 3. 今日失误/不足（具体不笼统，对应时间/任务/习惯/情绪）
1. 
2. 
3. 

*** 4. 明日改进方案（对应失误，可落地、可执行）
1. 
2. 
3. 

** 明日核心优先级（3条以内，避免多任务焦虑）
1.  优先完成 #A 级核心任务：XXX
2.  落实改进方案：如设置强制关机/晨起不碰手机
3.  碎片化时间利用：如通勤完成XX轻量任务

* <`(format-time-string "%Y-%m-%d %a" (time-add (current-time) (* 86400 1)))`> 今日核心主题 :工作日:
** 今日计划 [%]
*** TODO 复现ablation实验结果 【下午完成，整理数据】 :research:#A:
*** TODO 整理agent memory机制笔记 【工位专注梳理】 :research:
*** TODO 上肢 健身 :body:
*** TODO 拉伸 15min :body:
*** TODO 23:00前早睡 :body:routine:
*** TODO 精读《全力的游戏》章节 :English:fiction:
*** TODO 精读《庄子》核心句 【标注感悟】 :Phi:

** 今日反思（核心模块，对应保持/失误/改进）
*** 1. 总体评价（一句话总结今日状态）
- 示例：总体完成核心工作任务，状态专注，时间分配基本合理；或今日进度滞后，需调整优先级和时间管理。

*** 2. 值得保持的点（提炼优势/好习惯，具体到场景）
1. 
2. 
3. 

*** 3. 今日失误/不足（具体不笼统，对应时间/任务/习惯/情绪）
1. 
2. 
3. 

*** 4. 明日改进方案（对应失误，可落地、可执行）
1. 
2. 
3. 

** 明日核心优先级（3条以内，避免多任务焦虑）
1.  优先完成 #A 级核心任务：XXX
2.  落实改进方案：如设置强制关机/晨起不碰手机
3.  碎片化时间利用：如通勤完成XX轻量任务

