docs/new-todo-system.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-03 Tue 11:22 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>我的全新TODO管理系统</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/about.html" class="button">About</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">我的全新TODO管理系统</h1>
<p>
最近又重新思考了一下如何进行个人工作的版本流控制，对之前的reflection思路进行了一波改造升级。
</p>

<p>
改进的原则是：
</p>

<ul class="org-ul">
<li>实用大于美观。不过度追求所覆盖的全面和完整，只聚焦在最重要的几个方向。其余的则放空</li>
<li>强调可持续性。
<ul class="org-ul">
<li>提供退出机制，以应对较为简单的个人记录。</li>
<li>提供模板，以方便插入</li>
<li>在文件管理与版本控制上也突出可持续。不会出现过往todo list过于复杂的情况</li>
</ul></li>
<li>与当前工作流深度嵌入
<ul class="org-ul">
<li>Git集成与全端浏览</li>
<li>Emacs + Org Mode集成</li>
</ul></li>
<li>诚实与robustness
<ul class="org-ul">
<li>仓库私有</li>
<li>扩展性强</li>
</ul></li>
</ul>

<p>
目前新版的个人版本控制流程如下。
</p>
<div id="outline-container-orgd3d9532" class="outline-2">
<h2 id="orgd3d9532"><span class="section-number-2">1.</span> 系统组件分析</h2>
<div class="outline-text-2" id="text-1">
<p>
整体的项目如下图所示：
</p>

<div class="org-src-container">
<pre class="src src-shell">&#9500;&#9472;&#9472; appearance
&#9474;&#160;&#160; &#9500;&#9472;&#9472; cloth.org
&#9474;&#160;&#160; &#9492;&#9472;&#9472; haircut.org
&#9500;&#9472;&#9472; body
&#9474;&#160;&#160; &#9500;&#9472;&#9472; physical
&#9474;&#160;&#160; &#9474;&#160;&#160; &#9492;&#9472;&#9472; 2026-M02.org
&#9474;&#160;&#160; &#9492;&#9472;&#9472; sexual-love
&#9474;&#160;&#160;     &#9492;&#9472;&#9472; 2026-02.org
&#9500;&#9472;&#9472; finance
&#9474;&#160;&#160; &#9500;&#9472;&#9472; monthly
&#9474;&#160;&#160; &#9474;&#160;&#160; &#9492;&#9472;&#9472; 2026-M02.org
&#9474;&#160;&#160; &#9492;&#9472;&#9472; yearly
&#9474;&#160;&#160;     &#9492;&#9472;&#9472; 2026.org
&#9500;&#9472;&#9472; inbox.org
&#9500;&#9472;&#9472; README.md
&#9500;&#9472;&#9472; reflection
&#9474;&#160;&#160; &#9500;&#9472;&#9472; monthly
&#9474;&#160;&#160; &#9474;&#160;&#160; &#9492;&#9472;&#9472; 2026-M02.org
&#9474;&#160;&#160; &#9500;&#9472;&#9472; quarterly
&#9474;&#160;&#160; &#9474;&#160;&#160; &#9492;&#9472;&#9472; 2026-Q1.org
&#9474;&#160;&#160; &#9500;&#9472;&#9472; weekly
&#9474;&#160;&#160; &#9474;&#160;&#160; &#9492;&#9472;&#9472; 2026-W06.org
&#9474;&#160;&#160; &#9492;&#9472;&#9472; yearly
&#9474;&#160;&#160;     &#9492;&#9472;&#9472; 2026.org
&#9500;&#9472;&#9472; weekly
&#9474;&#160;&#160; &#9492;&#9472;&#9472; 2026-W06.org
</pre>
</div>

<p>
可以看出，整个项目仅仅包含四个方面，分别是周报（weekly），经济、身体、外貌。至于其他，比如社交等等暂时没有加进去；阅读之类的也没有显式地加进去。这不是因为后面二者并不重要，而是他们并不需要非常严格的长期监控与处理。
</p>

<p>
对于所关注的四个方面，只有weekly是需要日常维护的，剩余的如appearance、body、finance都可以以一个较低的频率进行更新。reflection则需要每周更新。具体来说是：
</p>

<ul class="org-ul">
<li>Weekly：将一周七天的所有计划纳入一个文件中进行管理。</li>
<li>Appearance：负责管理我的外在，维持作为一个正常人类的形象
<ul class="org-ul">
<li>Cloth：对我的衣服进行管理。定期更新、删除、修改。</li>
<li>Haircut：对我的头发进行管理。定期修理。</li>
</ul></li>
<li>Body：负责监控我的身体状况。与Appearance一样，我认为这也是仍然需要重点关注的点。
<ul class="org-ul">
<li>Physical：指个人的身体素质。包括：体重、体脂等个人数据。从每周的周报中统计进行各项体育运动、健身等等的强度，以构成反馈。</li>
<li>Sexual-Love：用于监控个人的性压抑程度。记录自己的性行为次数、频率、相关人员、时间。由此进行后续的心理健康状况分析。</li>
</ul></li>
<li>Finance：记录自己的经济状况。
<ul class="org-ul">
<li>Monthly：每个月都记录自己的支出和收益，挖掘出不合理的支出。设定消费数目，对金钱进行合理的分配。</li>
<li>Yearly：从全年的角度制定每一年的经济计划 （如学生时期可能以尽量产生赤字为主，多体验）。并设置每个方向的消费比重。</li>
</ul></li>
<li>Reflection
<ul class="org-ul">
<li>Weekly：基于每周周日志的文件对本周状态进行总结。 聚焦在细节。</li>
<li>Monthly：对于每个月的情况进行总结。 每个月都应该让事态产生明显变化。</li>
<li>Quarterly：对于每个季度进行总结。 每个季度都应该完成一个战略目标点。</li>
<li>Yearly：对全年的总结。 这应该站在一个比较高的层面进行总结。</li>
</ul></li>
<li>Inbox：用于记录某些灵光。需要被定期清理。</li>
</ul>
</div>
</div>
<div id="outline-container-org5269e0d" class="outline-2">
<h2 id="org5269e0d"><span class="section-number-2">2.</span> 一个理想的运行结构</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>每日开始，应该打开当周的weekly，撰写上一日的reflection</li>
<li>应排列今日的TODO，并按照流程逐步进行。</li>
<li>每周周五晚上或周六上午，应该进行每周的reflection，并整理手机上的身体数据。</li>
<li>每个月发工资时，对于这个月的银行流水进行总结和记录。检查银行卡、微信、支付宝等。</li>
<li>每个月月末阅读该月的relfection，然后撰写月度总结。</li>
<li>每次和导师开完会对appearance的情况进行一次更新。</li>
<li>每个季度撰写反思和总结。</li>
<li>每年都对全年的情况进行一次系统的分析。可以把语料发给AI。</li>
</ol>


<p>
维持持续记录的要点：
</p>
<ol class="org-ol">
<li>在周一、二 等日安排攻坚的难题。</li>
<li>research等tag的TODO ITEM个数应该与body、fiction、relax等实现平衡。</li>
<li>允许在某些特殊天里“潦草记录”。但是认为连续性最为重要。</li>
<li>允许补录。允许潦草补录。</li>
</ol>
</div>
</div>
<div id="outline-container-org559dfd1" class="outline-2">
<h2 id="org559dfd1"><span class="section-number-2">3.</span> Weekly 模板</h2>
<div class="outline-text-2" id="text-3">
<p>
我使用emacs的yas snippets搞了一个每周模板。如下：
</p>

<p>
#+begin_src snippets
</p>
</div>
</div>
<div id="outline-container-org7cd139a" class="outline-2">
<h2 id="org7cd139a"><span class="section-number-2">4.</span> &lt;`(format-time-string "%Y-%m-%d %a")`&gt; 今日核心主题&#xa0;&#xa0;&#xa0;<span class="tag"><span class="___">工作日</span></span></h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org4632c2c" class="outline-3">
<h3 id="org4632c2c"><span class="section-number-3">4.1.</span> 今日计划 <code>[%]</code></h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org3509d3f" class="outline-4">
<h4 id="org3509d3f"><span class="section-number-4">4.1.1.</span> <span class="todo TODO">TODO</span> 完成ablation实验 【上午完成，优先推进】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span>&#xa0;<span class="_A">#A</span></span></h4>
</div>
<div id="outline-container-orgcd2d779" class="outline-4">
<h4 id="orgcd2d779"><span class="section-number-4">4.1.2.</span> <span class="todo TODO">TODO</span> 理解现有agent memory机制 【通勤途中梳理】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span></span></h4>
</div>
<div id="outline-container-orgfa0a8ec" class="outline-4">
<h4 id="orgfa0a8ec"><span class="section-number-4">4.1.3.</span> <span class="done CANCELED">CANCELED</span> 暂缓任务示例 【标注原因，可选】</h4>
</div>
<div id="outline-container-orge937b02" class="outline-4">
<h4 id="orge937b02"><span class="section-number-4">4.1.4.</span> <span class="todo TODO">TODO</span> 腹部 健身&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span></span></h4>
</div>
<div id="outline-container-orgacae3ca" class="outline-4">
<h4 id="orgacae3ca"><span class="section-number-4">4.1.5.</span> <span class="todo TODO">TODO</span> 有氧 30min&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span></span></h4>
</div>
<div id="outline-container-org2f9363d" class="outline-4">
<h4 id="org2f9363d"><span class="section-number-4">4.1.6.</span> <span class="todo TODO">TODO</span> 23:00前早睡&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span>&#xa0;<span class="routine">routine</span></span></h4>
</div>
<div id="outline-container-orgbaa891e" class="outline-4">
<h4 id="orgbaa891e"><span class="section-number-4">4.1.7.</span> <span class="todo TODO">TODO</span> 阅读小说《全力的游戏》&#xa0;&#xa0;&#xa0;<span class="tag"><span class="English">English</span>&#xa0;<span class="fiction">fiction</span></span></h4>
</div>
<div id="outline-container-org2295903" class="outline-4">
<h4 id="org2295903"><span class="section-number-4">4.1.8.</span> <span class="todo TODO">TODO</span> 阅读《庄子》&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Phi">Phi</span></span></h4>
</div>
</div>
<div id="outline-container-org00cd618" class="outline-3">
<h3 id="org00cd618"><span class="section-number-3">4.2.</span> 今日反思（核心模块，对应保持/失误/改进）</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org95d2643" class="outline-4">
<h4 id="org95d2643"><span class="section-number-4">4.2.1.</span> 1. 总体评价（一句话总结今日状态）</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li>示例：总体完成核心工作任务，状态专注，时间分配基本合理；或今日进度滞后，需调整优先级和时间管理。</li>
</ul>
</div>
</div>
<div id="outline-container-org97739c3" class="outline-4">
<h4 id="org97739c3"><span class="section-number-4">4.2.2.</span> 2. 值得保持的点（提炼优势/好习惯，具体到场景）</h4>
<div class="outline-text-4" id="text-4-2-2">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-org468f8b9" class="outline-4">
<h4 id="org468f8b9"><span class="section-number-4">4.2.3.</span> 3. 今日失误/不足（具体不笼统，对应时间/任务/习惯/情绪）</h4>
<div class="outline-text-4" id="text-4-2-3">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-orgc2c5ad7" class="outline-4">
<h4 id="orgc2c5ad7"><span class="section-number-4">4.2.4.</span> 4. 明日改进方案（对应失误，可落地、可执行）</h4>
<div class="outline-text-4" id="text-4-2-4">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org15623cb" class="outline-3">
<h3 id="org15623cb"><span class="section-number-3">4.3.</span> 明日核心优先级（3条以内，避免多任务焦虑）</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>优先完成 #A 级核心任务：XXX</li>
<li>落实改进方案：如设置强制关机/晨起不碰手机</li>
<li>碎片化时间利用：如通勤完成XX轻量任务</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org9bcf418" class="outline-2">
<h2 id="org9bcf418"><span class="section-number-2">5.</span> &lt;`(format-time-string "%Y-%m-%d %a" (time-add (current-time) (* 86400 1)))`&gt; 今日核心主题&#xa0;&#xa0;&#xa0;<span class="tag"><span class="___">工作日</span></span></h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orge37b46a" class="outline-3">
<h3 id="orge37b46a"><span class="section-number-3">5.1.</span> 今日计划 <code>[%]</code></h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org24ae084" class="outline-4">
<h4 id="org24ae084"><span class="section-number-4">5.1.1.</span> <span class="todo TODO">TODO</span> 复现ablation实验结果 【下午完成，整理数据】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span>&#xa0;<span class="_A">#A</span></span></h4>
</div>
<div id="outline-container-org27eee93" class="outline-4">
<h4 id="org27eee93"><span class="section-number-4">5.1.2.</span> <span class="todo TODO">TODO</span> 整理agent memory机制笔记 【工位专注梳理】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span></span></h4>
</div>
<div id="outline-container-org04fd9d3" class="outline-4">
<h4 id="org04fd9d3"><span class="section-number-4">5.1.3.</span> <span class="todo TODO">TODO</span> 上肢 健身&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span></span></h4>
</div>
<div id="outline-container-org805a104" class="outline-4">
<h4 id="org805a104"><span class="section-number-4">5.1.4.</span> <span class="todo TODO">TODO</span> 拉伸 15min&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span></span></h4>
</div>
<div id="outline-container-org637a08e" class="outline-4">
<h4 id="org637a08e"><span class="section-number-4">5.1.5.</span> <span class="todo TODO">TODO</span> 23:00前早睡&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span>&#xa0;<span class="routine">routine</span></span></h4>
</div>
<div id="outline-container-org0759c11" class="outline-4">
<h4 id="org0759c11"><span class="section-number-4">5.1.6.</span> <span class="todo TODO">TODO</span> 精读《全力的游戏》章节&#xa0;&#xa0;&#xa0;<span class="tag"><span class="English">English</span>&#xa0;<span class="fiction">fiction</span></span></h4>
</div>
<div id="outline-container-orgfcab1a5" class="outline-4">
<h4 id="orgfcab1a5"><span class="section-number-4">5.1.7.</span> <span class="todo TODO">TODO</span> 精读《庄子》核心句 【标注感悟】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Phi">Phi</span></span></h4>
</div>
</div>
