docs/new-todo-system.html
<div id="outline-container-org031b0bf" class="outline-3">
<h3 id="org031b0bf"><span class="section-number-3">5.2.</span> 今日反思（核心模块，对应保持/失误/改进）</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgaca68e2" class="outline-4">
<h4 id="orgaca68e2"><span class="section-number-4">5.2.1.</span> 1. 总体评价（一句话总结今日状态）</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>示例：总体完成核心工作任务，状态专注，时间分配基本合理；或今日进度滞后，需调整优先级和时间管理。</li>
</ul>
</div>
</div>
<div id="outline-container-org5da526c" class="outline-4">
<h4 id="org5da526c"><span class="section-number-4">5.2.2.</span> 2. 值得保持的点（提炼优势/好习惯，具体到场景）</h4>
<div class="outline-text-4" id="text-5-2-2">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-org3e70c60" class="outline-4">
<h4 id="org3e70c60"><span class="section-number-4">5.2.3.</span> 3. 今日失误/不足（具体不笼统，对应时间/任务/习惯/情绪）</h4>
<div class="outline-text-4" id="text-5-2-3">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-orgfb667aa" class="outline-4">
<h4 id="orgfb667aa"><span class="section-number-4">5.2.4.</span> 4. 明日改进方案（对应失误，可落地、可执行）</h4>
<div class="outline-text-4" id="text-5-2-4">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd9bf791" class="outline-3">
<h3 id="orgd9bf791"><span class="section-number-3">5.3.</span> 明日核心优先级（3条以内，避免多任务焦虑）</h3>
<div class="outline-text-3" id="text-5-3">
<ol class="org-ol">
<li>优先完成 #A 级核心任务：XXX</li>
<li>落实改进方案：如设置强制关机/晨起不碰手机</li>
<li>碎片化时间利用：如通勤完成XX轻量任务</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgf3efc71" class="outline-2">
<h2 id="orgf3efc71"><span class="section-number-2">6.</span> &lt;`(format-time-string "%Y-%m-%d %a" (time-add (current-time) (* 86400 2)))`&gt; 今日核心主题&#xa0;&#xa0;&#xa0;<span class="tag"><span class="___">工作日</span>&#xa0;<span class="midweek">midweek</span></span></h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org1e699e4" class="outline-3">
<h3 id="org1e699e4"><span class="section-number-3">6.1.</span> 今日计划 <code>[%]</code></h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgc66d0e4" class="outline-4">
<h4 id="orgc66d0e4"><span class="section-number-4">6.1.1.</span> <span class="todo TODO">TODO</span> 撰写ablation实验分析 【上午完成，框架搭建】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span>&#xa0;<span class="_A">#A</span></span></h4>
</div>
<div id="outline-container-orged0e834" class="outline-4">
<h4 id="orged0e834"><span class="section-number-4">6.1.2.</span> <span class="todo TODO">TODO</span> 调研agent memory相关论文 【筛选3篇核心文献】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span></span></h4>
</div>
<div id="outline-container-orgaf1f336" class="outline-4">
<h4 id="orgaf1f336"><span class="section-number-4">6.1.3.</span> <span class="todo TODO">TODO</span> 核心 健身&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span></span></h4>
</div>
<div id="outline-container-org2a86044" class="outline-4">
<h4 id="org2a86044"><span class="section-number-4">6.1.4.</span> <span class="todo TODO">TODO</span> 有氧 20min&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span></span></h4>
</div>
<div id="outline-container-org025b880" class="outline-4">
<h4 id="org025b880"><span class="section-number-4">6.1.5.</span> <span class="todo TODO">TODO</span> 22:50前早睡&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span>&#xa0;<span class="routine">routine</span></span></h4>
</div>
<div id="outline-container-org8b78d05" class="outline-4">
<h4 id="org8b78d05"><span class="section-number-4">6.1.6.</span> <span class="todo TODO">TODO</span> 英语长难句分析 【《全力的游戏》节选】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="English">English</span></span></h4>
</div>
<div id="outline-container-org368a87a" class="outline-4">
<h4 id="org368a87a"><span class="section-number-4">6.1.7.</span> <span class="todo TODO">TODO</span> 梳理《庄子》思想框架&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Phi">Phi</span></span></h4>
</div>
</div>
<div id="outline-container-org1a13cc8" class="outline-3">
<h3 id="org1a13cc8"><span class="section-number-3">6.2.</span> 今日反思（核心模块，对应保持/失误/改进）</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org841ce7b" class="outline-4">
<h4 id="org841ce7b"><span class="section-number-4">6.2.1.</span> 1. 总体评价（一句话总结今日状态）</h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li>示例：总体完成核心工作任务，状态专注，时间分配基本合理；或今日进度滞后，需调整优先级和时间管理。</li>
</ul>
</div>
</div>
<div id="outline-container-org25f3ec4" class="outline-4">
<h4 id="org25f3ec4"><span class="section-number-4">6.2.2.</span> 2. 值得保持的点（提炼优势/好习惯，具体到场景）</h4>
<div class="outline-text-4" id="text-6-2-2">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-org406b1ad" class="outline-4">
<h4 id="org406b1ad"><span class="section-number-4">6.2.3.</span> 3. 今日失误/不足（具体不笼统，对应时间/任务/习惯/情绪）</h4>
<div class="outline-text-4" id="text-6-2-3">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-orgaf5971a" class="outline-4">
<h4 id="orgaf5971a"><span class="section-number-4">6.2.4.</span> 4. 明日改进方案（对应失误，可落地、可执行）</h4>
<div class="outline-text-4" id="text-6-2-4">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org6cc4a59" class="outline-3">
<h3 id="org6cc4a59"><span class="section-number-3">6.3.</span> 明日核心优先级（3条以内，避免多任务焦虑）</h3>
<div class="outline-text-3" id="text-6-3">
<ol class="org-ol">
<li>优先完成 #A 级核心任务：XXX</li>
<li>落实改进方案：如设置强制关机/晨起不碰手机</li>
<li>碎片化时间利用：如通勤完成XX轻量任务</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org472b097" class="outline-2">
<h2 id="org472b097"><span class="section-number-2">7.</span> &lt;`(format-time-string "%Y-%m-%d %a" (time-add (current-time) (* 86400 3)))`&gt; 今日核心主题&#xa0;&#xa0;&#xa0;<span class="tag"><span class="___">工作日</span></span></h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org586bc30" class="outline-3">
<h3 id="org586bc30"><span class="section-number-3">7.1.</span> 今日计划 <code>[%]</code></h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org276c075" class="outline-4">
<h4 id="org276c075"><span class="section-number-4">7.1.1.</span> <span class="todo TODO">TODO</span> 完善实验分析文档 【下午定稿，检查细节】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span>&#xa0;<span class="_A">#A</span></span></h4>
</div>
<div id="outline-container-orgac4b27a" class="outline-4">
<h4 id="orgac4b27a"><span class="section-number-4">7.1.2.</span> <span class="todo TODO">TODO</span> 整理agent memory论文笔记 【提炼核心观点】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span></span></h4>
</div>
<div id="outline-container-org26f3344" class="outline-4">
<h4 id="org26f3344"><span class="section-number-4">7.1.3.</span> <span class="todo TODO">TODO</span> 下肢 健身&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span></span></h4>
</div>
<div id="outline-container-orgec6ffc9" class="outline-4">
<h4 id="orgec6ffc9"><span class="section-number-4">7.1.4.</span> <span class="todo TODO">TODO</span> 散步 30min&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span></span></h4>
</div>
<div id="outline-container-org6790ffe" class="outline-4">
<h4 id="org6790ffe"><span class="section-number-4">7.1.5.</span> <span class="todo TODO">TODO</span> 23:00前早睡&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span>&#xa0;<span class="routine">routine</span></span></h4>
</div>
<div id="outline-container-org7eb9346" class="outline-4">
<h4 id="org7eb9346"><span class="section-number-4">7.1.6.</span> <span class="todo TODO">TODO</span> 阅读《全力的游戏》新章节&#xa0;&#xa0;&#xa0;<span class="tag"><span class="English">English</span>&#xa0;<span class="fiction">fiction</span></span></h4>
</div>
<div id="outline-container-org54ac34a" class="outline-4">
<h4 id="org54ac34a"><span class="section-number-4">7.1.7.</span> <span class="todo TODO">TODO</span> 书写《庄子》阅读感悟&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Phi">Phi</span>&#xa0;<span class="note">note</span></span></h4>
</div>
</div>
<div id="outline-container-org38a8932" class="outline-3">
<h3 id="org38a8932"><span class="section-number-3">7.2.</span> 今日反思（核心模块，对应保持/失误/改进）</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-orgee21555" class="outline-4">
<h4 id="orgee21555"><span class="section-number-4">7.2.1.</span> 1. 总体评价（一句话总结今日状态）</h4>
<div class="outline-text-4" id="text-7-2-1">
<ul class="org-ul">
<li>示例：总体完成核心工作任务，状态专注，时间分配基本合理；或今日进度滞后，需调整优先级和时间管理。</li>
</ul>
</div>
</div>
<div id="outline-container-org94d8da5" class="outline-4">
<h4 id="org94d8da5"><span class="section-number-4">7.2.2.</span> 2. 值得保持的点（提炼优势/好习惯，具体到场景）</h4>
<div class="outline-text-4" id="text-7-2-2">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-org072eb28" class="outline-4">
<h4 id="org072eb28"><span class="section-number-4">7.2.3.</span> 3. 今日失误/不足（具体不笼统，对应时间/任务/习惯/情绪）</h4>
<div class="outline-text-4" id="text-7-2-3">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-org64b4697" class="outline-4">
<h4 id="org64b4697"><span class="section-number-4">7.2.4.</span> 4. 明日改进方案（对应失误，可落地、可执行）</h4>
<div class="outline-text-4" id="text-7-2-4">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgfa918a2" class="outline-3">
<h3 id="orgfa918a2"><span class="section-number-3">7.3.</span> 明日核心优先级（3条以内，避免多任务焦虑）</h3>
<div class="outline-text-3" id="text-7-3">
<ol class="org-ol">
<li>优先完成 #A 级核心任务：XXX</li>
<li>落实改进方案：如设置强制关机/晨起不碰手机</li>
<li>碎片化时间利用：如通勤完成XX轻量任务</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org80d789c" class="outline-2">
<h2 id="org80d789c"><span class="section-number-2">8.</span> &lt;`(format-time-string "%Y-%m-%d %a" (time-add (current-time) (* 86400 4)))`&gt; 今日核心主题 :工作日:weekend-prep:</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org0f4a404" class="outline-3">
<h3 id="org0f4a404"><span class="section-number-3">8.1.</span> 今日计划 <code>[%]</code></h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org7b4af35" class="outline-4">
<h4 id="org7b4af35"><span class="section-number-4">8.1.1.</span> <span class="todo TODO">TODO</span> 提交实验分析文档 【上午完成，最终检查】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span>&#xa0;<span class="_A">#A</span></span></h4>
</div>
<div id="outline-container-org1b830ac" class="outline-4">
<h4 id="org1b830ac"><span class="section-number-4">8.1.2.</span> <span class="todo TODO">TODO</span> 制定下周agent memory研究计划 【通勤途中梳理】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span>&#xa0;<span class="plan">plan</span></span></h4>
</div>
<div id="outline-container-orgb2e3be5" class="outline-4">
<h4 id="orgb2e3be5"><span class="section-number-4">8.1.3.</span> <span class="todo TODO">TODO</span> 全身 轻量健身&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span></span></h4>
</div>
<div id="outline-container-orgd77e0f1" class="outline-4">
<h4 id="orgd77e0f1"><span class="section-number-4">8.1.4.</span> <span class="todo TODO">TODO</span> 拉伸 20min&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span></span></h4>
</div>
<div id="outline-container-org94e3668" class="outline-4">
<h4 id="org94e3668"><span class="section-number-4">8.1.5.</span> <span class="todo TODO">TODO</span> 22:40前早睡&#xa0;&#xa0;&#xa0;<span class="tag"><span class="body">body</span>&#xa0;<span class="routine">routine</span></span></h4>
</div>
<div id="outline-container-org1947d4d" class="outline-4">
<h4 id="org1947d4d"><span class="section-number-4">8.1.6.</span> <span class="todo TODO">TODO</span> 英语阅读复盘 【本周内容梳理】&#xa0;&#xa0;&#xa0;<span class="tag"><span class="English">English</span></span></h4>
</div>
<div id="outline-container-org739cbc2" class="outline-4">
<h4 id="org739cbc2"><span class="section-number-4">8.1.7.</span> <span class="todo TODO">TODO</span> 本周《庄子》阅读复盘&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Phi">Phi</span>&#xa0;<span class="review">review</span></span></h4>
</div>
</div>
<div id="outline-container-orgca9086c" class="outline-3">
<h3 id="orgca9086c"><span class="section-number-3">8.2.</span> 今日反思（核心模块，对应保持/失误/改进）</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-orgee77a14" class="outline-4">
<h4 id="orgee77a14"><span class="section-number-4">8.2.1.</span> 1. 总体评价（一句话总结今日状态）</h4>
<div class="outline-text-4" id="text-8-2-1">
<ul class="org-ul">
<li>示例：总体完成核心工作任务，状态专注，时间分配基本合理；或今日进度滞后，需调整优先级和时间管理。</li>
</ul>
</div>
</div>
<div id="outline-container-org6a244f7" class="outline-4">
<h4 id="org6a244f7"><span class="section-number-4">8.2.2.</span> 2. 值得保持的点（提炼优势/好习惯，具体到场景）</h4>
<div class="outline-text-4" id="text-8-2-2">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-org46fb022" class="outline-4">
<h4 id="org46fb022"><span class="section-number-4">8.2.3.</span> 3. 今日失误/不足（具体不笼统，对应时间/任务/习惯/情绪）</h4>
<div class="outline-text-4" id="text-8-2-3">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-org8c48fdb" class="outline-4">
<h4 id="org8c48fdb"><span class="section-number-4">8.2.4.</span> 4. 周末改进落实（对应失误，周末重点调整）</h4>
<div class="outline-text-4" id="text-8-2-4">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
</div>
